Secalot/secalot.firmware/platform/mk82/src/usb/mk82UsbDeviceDescriptor.c
/*
 * Secalot firmware.
 * Copyright (c) 2017 Matvey Mukha <matvey.mukha@gmail.com>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 */

/*
* Copyright (c) 2015, Freescale Semiconductor, Inc.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*
* o Redistributions of source code must retain the above copyright notice, this list
*   of conditions and the following disclaimer.
*
* o Redistributions in binary form must reproduce the above copyright notice, this
*   list of conditions and the following disclaimer in the documentation and/or
*   other materials provided with the distribution.
*
* o Neither the name of Freescale Semiconductor, Inc. nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
* ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/
#include "usb_device_config.h"
#include "usb.h"
#include "usb_device.h"

#include "ccidClassDescriptor.h"
#include "mk82USBDeviceDescriptor.h"

#ifdef FIRMWARE
#include "sfHidReportDescriptor.h"
#include "btcHidReportDescriptor.h"
#endif /* FIRMWARE */

/*******************************************************************************
* API
******************************************************************************/
/*!
 * @brief USB device callback function.
 *
 * This function handles the usb device specific requests.
 *
 * @param handle          The USB device handle.
 * @param event           The USB device event type.
 * @param param           The parameter of the device specific request.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
extern usb_status_t USB_DeviceCallback(usb_device_handle handle, uint32_t event, void *param);

/*******************************************************************************
* Variables
******************************************************************************/
static uint8_t mk82UsbCurrentConfiguration = 0;
static uint8_t mk82UsbInterfaces[MK82_USB_INTERFACE_COUNT];

#ifdef FIRMWARE
static uint8_t mk82UsbU2fReportDescriptor[] = {SF_REPORT_DESCRIPTOR};
static uint8_t mk82UsbBtcReportDescriptor[] = {BTC_REPORT_DESCRIPTOR};

static uint8_t mk82UsbKeyboardReportDescriptor[] = {
    0x05U, 0x01U, /* Usage Page (Generic Desktop)*/
    0x09U, 0x06U, /* Usage (Keyboard) */
    0xA1U, 0x01U, /* Collection (Application) */
    0x75U, 0x01U, /* Report Size (1U) */
    0x95U, 0x08U, /* Report Count (8U) */
    0x05U, 0x07U, /* Usage Page (Key Codes) */
    0x19U, 0xE0U, /* Usage Minimum (224U) */
    0x29U, 0xE7U, /* Usage Maximum (231U) */
    0x15U, 0x00U, /* Logical Minimum (0U) */
    0x25U, 0x01U, /* Logical Maximum (1U) */
    0x81U, 0x02U, /* Input(Data, Variable, Absolute) Modifier byte */

    0x95U, 0x01U, /* Report count (1U) */
    0x75U, 0x08U, /* Report Size (8U) */
    0x81U, 0x01U, /* Input (Constant), Reserved byte */

    0x95U, 0x05U, /* Report count (5U) */
    0x75U, 0x01U, /* Report Size (1U) */
    0x05U, 0x01U, /* Usage Page (Page# for LEDs) */
    0x19U, 0x01U, /* Usage Minimum (1U) */
    0x29U, 0x05U, /* Usage Maximum (5U) */
    0x91U, 0x02U, /* Output (Data, Variable, Absolute) LED report */

    0x95U, 0x01U, /* Report count (1U) */
    0x75U, 0x03U, /* Report Size (3U) */
    0x91U, 0x01U, /* Output (Constant), LED report padding */

    0x95U, 0x06U, /* Report count (6U) */
    0x75U, 0x08U, /* Report Size (8U) */
    0x15U, 0x00U, /* logical Minimum (0U) */
    0x25U, 0xFFU, /* logical Maximum (255U) */
    0x05U, 0x07U, /* Usage Page (Key Codes) */
    0x19U, 0x00U, /* Usage Minimum (0U) */
    0x29U, 0xFFU, /* Usage Maximum (255U) */
    0x81U, 0x00U, /* Input(Data, Array), Key arrays(6U bytes)*/

    0xC0U, /* end collection */
};
#endif /* FIRMWARE */

/* Define device descriptor */
static uint8_t mk82UsbDeviceDescriptor[] = {
    /* Size of this descriptor in bytes */
    USB_DESCRIPTOR_LENGTH_DEVICE,
    /* DEVICE Descriptor Type */
    USB_DESCRIPTOR_TYPE_DEVICE,
    /* USB Specification Release Number in Binary-Coded Decimal (i.e., 2.10 is 210H). */
    USB_SHORT_GET_LOW(MK82_USB_DEVICE_SPECIFICATION_VERSION), USB_SHORT_GET_HIGH(MK82_USB_DEVICE_SPECIFICATION_VERSION),
    /* Class code (assigned by the USB-IF). */
    MK82_USB_DEVICE_CLASS,
    /* Subclass code (assigned by the USB-IF). */
    MK82_USB_DEVICE_SUBCLASS,
    /* Protocol code (assigned by the USB-IF). */
    MK82_USB_DEVICE_PROTOCOL,
    /* Maximum packet size for endpoint zero (only 8, 16, 32, or 64 are valid) */
    USB_CONTROL_MAX_PACKET_SIZE,
    /* Vendor ID (assigned by the USB-IF) */
    0x09, 0x12,
/* Product ID (assigned by the manufacturer) */
#ifdef FIRMWARE
    0x77, 0x77,
#else  /* FIRMWARE */
    0x78, 0x77,
#endif /* FIRMWARE */
    /* Device release number in binary-coded decimal */
    USB_SHORT_GET_LOW(MK82_USB_DEVICE_VERSION), USB_SHORT_GET_HIGH(MK82_USB_DEVICE_VERSION),
    /* Index of string descriptor describing manufacturer */
    0x01,
    /* Index of string descriptor describing product */
    0x02,
    /* Index of string descriptor describing the device's serial number */
    0x00,
    /* Number of possible configurations */
    MK82_USB_DEVICE_CONFIGURATION_COUNT,
};

