Secalot/secalot.firmware/platform/mk82/src/usb/mk82UsbDeviceDescriptor.c
/* Define configuration descriptor */
static uint8_t mk82UsbDeviceConfigurationDescriptor[] = {
    /* Size of this descriptor in bytes */
    USB_DESCRIPTOR_LENGTH_CONFIGURE,
    /* CONFIGURATION Descriptor Type */
    USB_DESCRIPTOR_TYPE_CONFIGURE,
    /* Total length of data returned for this configuration. */
    USB_SHORT_GET_LOW(MK82_USB_TOTAL_CONFIGURATION_DESCRIPTOR_LENGTH),
    USB_SHORT_GET_HIGH(MK82_USB_TOTAL_CONFIGURATION_DESCRIPTOR_LENGTH),
    /* Number of interfaces supported by this configuration */
    MK82_USB_INTERFACE_COUNT,
    /* Value to use as an argument to the SetConfiguration() request to select this configuration */
    MK82_USB_DEFAULT_CONFIGURATION_VALUE,
    /* Index of string descriptor describing this configuration */
    0,
    /* Configuration characteristics D7: Reserved (set to one) D6: Self-powered D5: Remote Wakeup D4...0: Reserved
       (reset to zero) */
    (USB_DESCRIPTOR_CONFIGURE_ATTRIBUTE_D7_MASK) |
        (USB_DEVICE_CONFIG_SELF_POWER << USB_DESCRIPTOR_CONFIGURE_ATTRIBUTE_SELF_POWERED_SHIFT) |
        (USB_DEVICE_CONFIG_REMOTE_WAKEUP << USB_DESCRIPTOR_CONFIGURE_ATTRIBUTE_REMOTE_WAKEUP_SHIFT),
    /* Maximum power consumption of the USB * device from the bus in this specific * configuration when the device is
       fully * operational. Expressed in 2 mA units *  (i.e., 50 = 100 mA).  */
    MK82_USB_DEVICE_MAX_POWER,

    /* CCID Interface Descriptor */
    USB_DESCRIPTOR_LENGTH_INTERFACE, USB_DESCRIPTOR_TYPE_INTERFACE, MK82_USB_CCID_INTERFACE_NUMBER, 0x00,
    MK82_USB_CCID_NUMBER_OF_ENDPOINTS, MK82_USB_CCID_CLASS, MK82_USB_CCID_SUBCLASS, MK82_USB_CCID_PROTOCOL,
    0x00, /* Interface Description String Index*/

    CCID_DEVICE_CLASS_DESCRIPTOR,

    /*CCID Bulk IN Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_CCID_BULK_IN_ENDPOINT | (USB_IN << 7U),
    USB_ENDPOINT_BULK, USB_SHORT_GET_LOW(MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE),
    0x00, /* The polling interval value is every 0 Frames */

    /*CCID Bulk OUT Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_CCID_BULK_OUT_ENDPOINT | (USB_OUT << 7U),
    USB_ENDPOINT_BULK, USB_SHORT_GET_LOW(MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_CCID_BULK_ENDPOINTS_PACKET_SIZE),
    0x00 /* The polling interval value is every 0 Frames */

#ifdef FIRMWARE
    ,
    /* U2F Interface Descriptor */
    USB_DESCRIPTOR_LENGTH_INTERFACE, USB_DESCRIPTOR_TYPE_INTERFACE, MK82_USB_U2F_INTERFACE_NUMBER, 0x00,
    MK82_USB_U2F_NUMBER_OF_ENDPOINTS, MK82_USB_U2F_CLASS, MK82_USB_U2F_SUBCLASS, MK82_USB_U2F_PROTOCOL,
    0x00, /* Interface Description String Index*/

    MK82_USB_U2F_HID_DECRIPTOR_LENGTH,  // length of HID descriptor
    USB_DESCRIPTOR_TYPE_HID,            // descriptor type == HID  0x21
    USB_SHORT_GET_LOW(MK82_USB_U2F_HID_DECRIPTOR_SPEC_RELEASE),
    USB_SHORT_GET_HIGH(MK82_USB_U2F_HID_DECRIPTOR_SPEC_RELEASE),  // hid spec release
    MK82_USB_U2F_HID_DECRIPTOR_COUNTRY_CODE,                      // country code == Not Specified
    MK82_USB_U2F_HID_DECRIPTOR_NUMBER_OF_DESCRIPTORS,             // number of HID class descriptors
    USB_DESCRIPTOR_TYPE_HID_REPORT,                               // report descriptor type 0x22
    USB_SHORT_GET_LOW(sizeof(mk82UsbU2fReportDescriptor)),
    USB_SHORT_GET_HIGH(sizeof(mk82UsbU2fReportDescriptor)),  // total length of report descriptor

    /*U2F Interrupt IN Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_U2F_INTERRUPT_IN_ENDPOINT | (USB_IN << 7U),
    USB_ENDPOINT_INTERRUPT, USB_SHORT_GET_LOW(MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    MK82_USB_U2F_INTERRUPT_ENDPOINTS_POLLING_INTERVAL, /* The polling interval value is every 0 Frames */

    /*U2F Interrupt OUT Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_U2F_INTERRUPT_OUT_ENDPOINT | (USB_OUT << 7U),
    USB_ENDPOINT_INTERRUPT, USB_SHORT_GET_LOW(MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_U2F_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    MK82_USB_U2F_INTERRUPT_ENDPOINTS_POLLING_INTERVAL, /* The polling interval value is every 0 Frames */

    /* Keyboard Interface Descriptor */
    USB_DESCRIPTOR_LENGTH_INTERFACE, USB_DESCRIPTOR_TYPE_INTERFACE, MK82_USB_KBD_INTERFACE_NUMBER, 0x00,
    MK82_USB_KBD_NUMBER_OF_ENDPOINTS, MK82_USB_KBD_CLASS, MK82_USB_KBD_SUBCLASS, MK82_USB_KBD_PROTOCOL,
    0x00, /* Interface Description String Index*/

    MK82_USB_KBD_HID_DECRIPTOR_LENGTH,  // length of HID descriptor
    USB_DESCRIPTOR_TYPE_HID,            // descriptor type == HID  0x21
    USB_SHORT_GET_LOW(MK82_USB_KBD_HID_DECRIPTOR_SPEC_RELEASE),
    USB_SHORT_GET_HIGH(MK82_USB_KBD_HID_DECRIPTOR_SPEC_RELEASE),  // hid spec release
    MK82_USB_KBD_HID_DECRIPTOR_COUNTRY_CODE,                      // country code == Not Specified
    MK82_USB_KBD_HID_DECRIPTOR_NUMBER_OF_DESCRIPTORS,             // number of HID class descriptors
    USB_DESCRIPTOR_TYPE_HID_REPORT,                               // report descriptor type 0x22
    USB_SHORT_GET_LOW(sizeof(mk82UsbKeyboardReportDescriptor)),
    USB_SHORT_GET_HIGH(sizeof(mk82UsbKeyboardReportDescriptor)),  // total length of report descriptor

    /* Keyboard Interrupt IN Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_KBD_INTERRUPT_IN_ENDPOINT | (USB_IN << 7U),
    USB_ENDPOINT_INTERRUPT, USB_SHORT_GET_LOW(MK82_USB_KBD_INTERRUPT_ENDPOINT_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_KBD_INTERRUPT_ENDPOINT_PACKET_SIZE),
    MK82_USB_KBD_INTERRUPT_ENDPOINT_POLLING_INTERVAL, /* The polling interval value is every 0 Frames */

    /* BTC Interface Descriptor */
    USB_DESCRIPTOR_LENGTH_INTERFACE, USB_DESCRIPTOR_TYPE_INTERFACE, MK82_USB_BTC_INTERFACE_NUMBER, 0x00,
    MK82_USB_BTC_NUMBER_OF_ENDPOINTS, MK82_USB_BTC_CLASS, MK82_USB_BTC_SUBCLASS, MK82_USB_BTC_PROTOCOL,
    0x00, /* Interface Description String Index*/

    MK82_USB_BTC_HID_DECRIPTOR_LENGTH,  // length of HID descriptor
    USB_DESCRIPTOR_TYPE_HID,            // descriptor type == HID  0x21
    USB_SHORT_GET_LOW(MK82_USB_BTC_HID_DECRIPTOR_SPEC_RELEASE),
    USB_SHORT_GET_HIGH(MK82_USB_BTC_HID_DECRIPTOR_SPEC_RELEASE),  // hid spec release
    MK82_USB_BTC_HID_DECRIPTOR_COUNTRY_CODE,                      // country code == Not Specified
    MK82_USB_BTC_HID_DECRIPTOR_NUMBER_OF_DESCRIPTORS,             // number of HID class descriptors
    USB_DESCRIPTOR_TYPE_HID_REPORT,                               // report descriptor type 0x22
    USB_SHORT_GET_LOW(sizeof(mk82UsbBtcReportDescriptor)),
    USB_SHORT_GET_HIGH(sizeof(mk82UsbBtcReportDescriptor)),  // total length of report descriptor

    /*BTC Interrupt IN Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_BTC_INTERRUPT_IN_ENDPOINT | (USB_IN << 7U),
    USB_ENDPOINT_INTERRUPT, USB_SHORT_GET_LOW(MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    MK82_USB_BTC_INTERRUPT_ENDPOINTS_POLLING_INTERVAL, /* The polling interval value is every 0 Frames */

    /*BTC Interrupt OUT Endpoint descriptor */
    USB_DESCRIPTOR_LENGTH_ENDPOINT, USB_DESCRIPTOR_TYPE_ENDPOINT, MK82_USB_BTC_INTERRUPT_OUT_ENDPOINT | (USB_OUT << 7U),
    USB_ENDPOINT_INTERRUPT, USB_SHORT_GET_LOW(MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    USB_SHORT_GET_HIGH(MK82_USB_BTC_INTERRUPT_ENDPOINTS_PACKET_SIZE),
    MK82_USB_BTC_INTERRUPT_ENDPOINTS_POLLING_INTERVAL, /* The polling interval value is every 0 Frames */
#endif                                                 /* FIRMWARE */
};

