Secalot/secalot.firmware/platform/mk82/src/usb/mk82UsbDeviceDescriptor.c
/* Define string descriptor */
static uint8_t mk82UsbDeviceString0[MK82_USB_DESCRIPTOR_LENGTH_STRING0] = {sizeof(mk82UsbDeviceString0),
                                                                           USB_DESCRIPTOR_TYPE_STRING, 0x09, 0x04};

static uint8_t mk82UsbDeviceString1[MK82_USB_DESCRIPTOR_LENGTH_STRING1] = {
    sizeof(mk82UsbDeviceString1), USB_DESCRIPTOR_TYPE_STRING, 'S', 0, 'e', 0, 'c', 0, 'a', 0, 'l', 0, 'o', 0, 't', 0};

#ifdef FIRMWARE
static uint8_t mk82UsbDeviceString2[MK82_USB_DESCRIPTOR_LENGTH_STRING2] = {sizeof(mk82UsbDeviceString2),
                                                                           USB_DESCRIPTOR_TYPE_STRING,
                                                                           'S',
                                                                           0,
                                                                           'e',
                                                                           0,
                                                                           'c',
                                                                           0,
                                                                           'a',
                                                                           0,
                                                                           'l',
                                                                           0,
                                                                           'o',
                                                                           0,
                                                                           't',
                                                                           0,
                                                                           ' ',
                                                                           0,
                                                                           'D',
                                                                           0,
                                                                           'o',
                                                                           0,
                                                                           'n',
                                                                           0,
                                                                           'g',
                                                                           0,
                                                                           'l',
                                                                           0,
                                                                           'e',
                                                                           0};

#else  /* FIRMWARE */
static uint8_t mk82UsbDeviceString2[MK82_USB_DESCRIPTOR_LENGTH_STRING2] = {sizeof(mk82UsbDeviceString2),
                                                                           USB_DESCRIPTOR_TYPE_STRING,
                                                                           'S',
                                                                           0,
                                                                           'e',
                                                                           0,
                                                                           'c',
                                                                           0,
                                                                           'a',
                                                                           0,
                                                                           'l',
                                                                           0,
                                                                           'o',
                                                                           0,
                                                                           't',
                                                                           0,
                                                                           ' ',
                                                                           0,
                                                                           'B',
                                                                           0,
                                                                           'o',
                                                                           0,
                                                                           'o',
                                                                           0,
                                                                           't',
                                                                           0,
                                                                           'l',
                                                                           0,
                                                                           'o',
                                                                           0,
                                                                           'a',
                                                                           0,
                                                                           'd',
                                                                           0,
                                                                           'e',
                                                                           0,
                                                                           'r',
                                                                           0};
#endif /* FIRMWARE */

static uint8_t *mk82UsbDeviceStringDescriptorArray[MK82_USB_DEVICE_STRING_COUNT] = {
    mk82UsbDeviceString0, mk82UsbDeviceString1, mk82UsbDeviceString2};

/* Define string descriptor size */
static uint32_t mk82UsbDeviceStringDescriptorLength[MK82_USB_DEVICE_STRING_COUNT] = {
    sizeof(mk82UsbDeviceString0), sizeof(mk82UsbDeviceString1), sizeof(mk82UsbDeviceString2)};
static usb_language_t mk82UsbDeviceLanguage[MK82_USB_DEVICE_LANGUAGE_COUNT] = {{
    mk82UsbDeviceStringDescriptorArray, mk82UsbDeviceStringDescriptorLength, (uint16_t)0x0409,
}};

static usb_language_list_t g_UsbDeviceLanguageList = {
    mk82UsbDeviceString0, sizeof(mk82UsbDeviceString0), mk82UsbDeviceLanguage, MK82_USB_DEVICE_LANGUAGE_COUNT,
};

